### Exponential Distribution

In [1]:
import pandas as pd

In [20]:
df = pd.DataFrame({'A':[1,2,3,4],'B':[55,66,77,88]})

In [21]:
df

   A   B
0  1  55
1  2  66
2  3  77
3  4  88

In [22]:
df.corr()

     A    B
A  1.0  1.0
B  1.0  1.0

In [34]:
import numpy as np
df1 = pd.DataFrame({'A':np.random.randint(1,10,100),'B':np.random.randint(3,9,100)})
df1['B'] = df1['B']**2

In [35]:
df1.corr()

          A         B
A  1.000000 -0.104133
B -0.104133  1.000000

In [36]:
df1['A'] = df1.A - df1.A.std()

In [37]:
df1['B'] = df1.B - df1.B.std()

In [38]:
df1.corr()

          A         B
A  1.000000 -0.104133
B -0.104133  1.000000

In [39]:
df1.cov()

          A           B
A  6.591515   -4.993939
B -4.993939  348.916667

<img src="">

In [41]:
titanic_data = pd.read_csv('https://raw.githubusercontent.com/zekelabs/machine-learning-for-beginners/master/data/titanic-train.csv')

In [42]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [45]:
titanic_data[titanic_data.Embarked.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [46]:
titanic_data.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [49]:
titanic_data['name_len'] = titanic_data.Name.str.len()

In [50]:
titanic_data.name_len.max()

82

In [51]:
titanic_data[titanic_data.name_len == 82]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,name_len
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9,C65,C,82

In [52]:
titanic_data.Age.mean()

29.69911764705882

In [53]:
titanic_data.Age.median()

28.0

In [54]:
titanic_data[titanic_data.Sex == 'male'].Age.mean()

30.72664459161148

In [55]:
titanic_data[titanic_data.Sex == 'female'].Age.mean()

27.915708812260537

In [70]:
def f(r):
    if r['Sex'] == 'male' and np.isnan(r['Age']) :
        return 30.7
    elif r['Sex'] == 'female' and np.isnan(r['Age']):
        return 27.9
    else:
        return r['Age']
        
titanic_data.apply(f,axis=1)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5      30.7
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17     30.7
18     31.0
19     27.9
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26     30.7
27     19.0
28     27.9
29     30.7
       ...
861    21.0
862    48.0
863    27.9
864    24.0
865    42.0
866    27.0
867    31.0
868    30.7
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878    30.7
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888    27.9
889    26.0
890    32.0
Length: 891, dtype: float64

In [72]:
titanic_data.Age.fillna(method='ffill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5      35.0
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17      2.0
18     31.0
19     31.0
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26     38.0
27     19.0
28     19.0
29     19.0
       ...
861    21.0
862    48.0
863    48.0
864    24.0
865    42.0
866    27.0
867    31.0
868    31.0
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878    19.0
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888    19.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [73]:
titanic_data.Age.replace(22.0,33.4)

0      33.4
1      38.0
2      26.0
3      35.0
4      35.0
5       NaN
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17      NaN
18     31.0
19      NaN
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26      NaN
27     19.0
28      NaN
29      NaN
       ...
861    21.0
862    48.0
863     NaN
864    24.0
865    42.0
866    27.0
867    31.0
868     NaN
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878     NaN
879    56.0
880    25.0
881    33.0
882    33.4
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64